samuelpoiraud/robot/STM32/QS/QS_uart.c
/*
 *	Club Robot ESEO 2008 - 2015
 *	Archi-Tech', Pierre & Guy, Holly & Wood
 *
 *	Fichier : QS_uart.c
 *	Package : Qualite Soft
 *	Description : fonction d'utilisation des uart pour
 *					interfacage rs232
 *	Auteur : Jacen / Alexis / Nirgal
 *	Licence : CeCILL-C (voir LICENCE.txt)
 *	Version 20100924
 */

#include "QS_uart.h"
#include "QS_ports.h"
#include "stm32f4xx_usart.h"

#include "../config/config_pin.h"

#ifndef USART_FOR_PRINTF
	#define USART_FOR_PRINTF		1	//Default uart for output : 1.
#endif

#if USART_FOR_PRINTF == 1
	#define USART_FOR_PRINTF_PTR USART1
#elif USART_FOR_PRINTF == 2
	#define USART_FOR_PRINTF_PTR USART2
#elif	USART_FOR_PRINTF == 3
	#define USART_FOR_PRINTF_PTR USART3
#elif USART_FOR_PRINTF == 4
	#define USART_FOR_PRINTF_PTR USART4
#elif	 USART_FOR_PRINTF == 5
	#define USART_FOR_PRINTF_PTR USART5
#elif	 USART_FOR_PRINTF == 6
	#define USART_FOR_PRINTF_PTR USART6
#endif

//	Determination de la vitesse de l'uart en fonction
//	de la PLL utilisée
#ifndef UART1_BAUDRATE
	#define UART1_BAUDRATE 115200
#endif
#ifndef UART2_BAUDRATE
	#define UART2_BAUDRATE 115200
#endif
#ifndef UART3_BAUDRATE
	#define UART3_BAUDRATE 115200
#endif
#ifndef UART4_BAUDRATE
	#define UART4_BAUDRATE 115200
#endif
#ifndef UART5_BAUDRATE
	#define UART5_BAUDRATE 115200
#endif
#ifndef UART6_BAUDRATE
	#define UART6_BAUDRATE 115200
#endif

/* Variables Globales pour l'UART */
#ifdef USE_UART1RXINTERRUPT
	static Uint8 m_u1rxbuf[UART_RX_BUF_SIZE];
	static volatile Uint32 m_u1rxnum;
	static volatile bool_e m_u1rx;	// message reçu sur uart1
#endif /* def USE_UART1RXINTERRUPT */
#ifdef USE_UART2RXINTERRUPT
	static Uint8 m_u2rxbuf[UART_RX_BUF_SIZE];
	static volatile Uint32 m_u2rxnum;
	static volatile bool_e m_u2rx;	// message reçu sur uart2
#endif /* def USE_UART2RXINTERRUPT */
#ifdef USE_UART3RXINTERRUPT
	static Uint8 m_u3rxbuf[UART_RX_BUF_SIZE];
	static volatile Uint32 m_u3rxnum;
	static volatile bool_e m_u3rx;	// message reçu sur uart3
#endif /* def USE_UART3RXINTERRUPT */
#ifdef USE_UART4RXINTERRUPT
	static Uint8 m_u4rxbuf[UART_RX_BUF_SIZE];
	static volatile Uint32 m_u4rxnum;
	static volatile bool_e m_u4rx;	// message reçu sur uart4
#endif /* def USE_UART3RXINTERRUPT */
#ifdef USE_UART5RXINTERRUPT
	static Uint8 m_u5rxbuf[UART_RX_BUF_SIZE];
	static volatile Uint32 m_u5rxnum;
	static volatile bool_e m_u5rx;	// message reçu sur uart5
#endif /* def USE_UART3RXINTERRUPT */
#ifdef USE_UART6RXINTERRUPT
	static Uint8 m_u6rxbuf[UART_RX_BUF_SIZE];
	static volatile Uint32 m_u6rxnum;
	static volatile bool_e m_u6rx;	// message reçu sur uart6
#endif /* def USE_UART3RXINTERRUPT */
#if (defined USE_UART1TXINTERRUPT || defined USE_UART2TXINTERRUPT || defined USE_UART3TXINTERRUPT || defined USE_UART4TXINTERRUPT || defined USE_UART6TXINTERRUPT || defined USE_UART6TXINTERRUPT)
	typedef struct
	{
		volatile Uint8 * datas;
		Uint16 size;
		Uint16 nb_datas;
		Uint16 index_read;
		Uint16 index_write;
	}buffer_t;

	bool_e IsFull_buffer(volatile buffer_t * b)
	{
		if(b->nb_datas >= b->size)
			return TRUE;
		else
			return FALSE;
	}

	bool_e IsNotEmpty_buffer(volatile buffer_t * b)
	{

		if(b->nb_datas > (Uint8)0)
			return TRUE;
		else
			return FALSE;
	}
#endif

static volatile UART_dataReceivedFunctionPtr listennerDataReceived[6] = {NULL};
static volatile bool_e initialized = FALSE;

void UART_deInit(void){
#ifdef USE_UART1
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE);
#endif

#ifdef USE_UART2
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, DISABLE);
#endif

#ifdef USE_UART3
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, DISABLE);
#endif
#ifdef USE_UART4
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, DISABLE);
#endif
#ifdef USE_UART5
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, DISABLE);
#endif
#ifdef USE_UART6
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, DISABLE);
#endif
	initialized = FALSE;
}

/*	fonction initialisant les uart choisis
	vitesse : 115200 bauds (par défaut)
	bits de donnees : 8
	parite : aucune
	bit de stop : 1
	pas de controle de flux
*/
void UART_init(void)
{
	if(initialized)
		return;
	initialized = TRUE;

	NVIC_InitTypeDef NVIC_InitStructure;

	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

	PORTS_uarts_init();

#ifdef USE_UART1
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	USART_OverSampling8Cmd(USART1, ENABLE);
	UART_set_baudrate(1, UART1_BAUDRATE);

	#ifdef USE_UART1RXINTERRUPT
		m_u1rxnum = 0;
		m_u1rx = 0;
		/* Enable the USART1 Interrupt */
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
		NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
		NVIC_Init(&NVIC_InitStructure);
		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	#endif

	/* Enable USART */
	USART_Cmd(USART1, ENABLE);
#endif


#ifdef USE_UART2
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	USART_OverSampling8Cmd(USART2, ENABLE);
	UART_set_baudrate(2, UART2_BAUDRATE);

	#ifdef USE_UART2RXINTERRUPT
		m_u2rxnum = 0;
		m_u2rx = 0;
		/* Enable the USART1 Interrupt */
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
		NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
		NVIC_Init(&NVIC_InitStructure);
		USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
	#endif

	/* Enable USART */
	USART_Cmd(USART2, ENABLE);
#endif

#ifdef USE_UART3
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	USART_OverSampling8Cmd(USART3, ENABLE);
	UART_set_baudrate(3, UART3_BAUDRATE);

	#ifdef USE_UART3RXINTERRUPT
		m_u3rxnum = 0;
		m_u3rx = 0;
		/* Enable the USART1 Interrupt */
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
		NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
		NVIC_Init(&NVIC_InitStructure);
		USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
	#endif

	/* Enable USART */
	USART_Cmd(USART3, ENABLE);
#endif
#ifdef USE_UART4
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
	USART_OverSampling8Cmd(UART4, ENABLE);
	UART_set_baudrate(4, UART4_BAUDRATE);

	#ifdef USE_UART4RXINTERRUPT
		m_u4rxnum = 0;
		m_u4rx = 0;
		/* Enable the USART1 Interrupt */
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
		NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;
		NVIC_Init(&NVIC_InitStructure);
		USART_ITConfig(UART4, USART_IT_RXNE, ENABLE);
	#endif

	/* Enable USART */
	USART_Cmd(UART4, ENABLE);
#endif
#ifdef USE_UART5
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);
	USART_OverSampling8Cmd(UART5, ENABLE);
	UART_set_baudrate(5, UART5_BAUDRATE);

	#ifdef USE_UART5RXINTERRUPT
		m_u5rxnum = 0;
		m_u5rx = 0;
		/* Enable the USART1 Interrupt */
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
		NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;
		NVIC_Init(&NVIC_InitStructure);
		USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);
	#endif

	/* Enable USART */
	USART_Cmd(UART5, ENABLE);
#endif
#ifdef USE_UART6
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);
	USART_OverSampling8Cmd(USART6, ENABLE);
	UART_set_baudrate(6, UART6_BAUDRATE);

	#ifdef USE_UART6RXINTERRUPT
		m_u6rxnum = 0;
		m_u6rx = 0;
		/* Enable the USART1 Interrupt */
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
		NVIC_InitStructure.NVIC_IRQChannel = USART6_IRQn;
		NVIC_Init(&NVIC_InitStructure);
		USART_ITConfig(USART6, USART_IT_RXNE, ENABLE);
	#endif

	/* Enable USART */
	USART_Cmd(USART6, ENABLE);
#endif
}

void UART_set_baudrate(Uint8 uart_id, Uint32 baudrate) {
	USART_InitTypeDef USART_InitStructure;

	assert(uart_id <= 6);

	USART_InitStructure.USART_BaudRate = baudrate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

		switch(uart_id) {
		case 1:
			#ifdef USE_UART1_FLOWCONTROL
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
			#endif
			USART_Init(USART1, &USART_InitStructure);
			break;

