samuelpoiraud/robot/STM32/QS/QS_uart.c
		case 2:
			#ifdef USE_UART2_FLOWCONTROL
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
			#endif
			USART_Init(USART2, &USART_InitStructure);
			break;

		case 3:
			#ifdef USE_UART3_FLOWCONTROL
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
			#endif
			USART_Init(USART3, &USART_InitStructure);
			break;

		case 4:
			#ifdef USE_UART4_FLOWCONTROL
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
			#endif
			USART_Init(UART4, &USART_InitStructure);
			break;

		case 5:
			#ifdef USE_UART5_FLOWCONTROL
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
			#endif
			USART_Init(UART5, &USART_InitStructure);
			break;

		case 6:
			#ifdef USE_UART6_FLOWCONTROL
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
			#endif
			USART_Init(USART6, &USART_InitStructure);
			break;

		default:
			break;
	}
}

void UART_setListenner(Uint8 uart_id, UART_dataReceivedFunctionPtr function){
	assert(uart_id > 0 && uart_id <= 6);

	listennerDataReceived[uart_id-1] = function;
}
//Appelée par un printf
int _write(int file, char *ptr, int len)
{
	int i;

	switch (file)
	{
		case 0:
		case 1:
			for (i = 0; i < len; ++i)
			{
				#if USART_FOR_PRINTF == 1
					UART1_putc(*ptr++);
				#elif USART_FOR_PRINTF == 2
					UART2_putc(*ptr++);
				#elif	USART_FOR_PRINTF == 3
					UART3_putc(*ptr++);
				#elif USART_FOR_PRINTF == 4
					UART4_putc(*ptr++);
				#elif	 USART_FOR_PRINTF == 5
					UART5_putc(*ptr++);
				#elif	 USART_FOR_PRINTF == 6
					UART6_putc(*ptr++);
				#endif
			}
			return len;
			break;

		case 2:  //stderr = problème (entre autre trap_handler) donc pas de buffering
			for (i = 0; i < len; ++i)
			{
				while(USART_GetFlagStatus(USART_FOR_PRINTF_PTR, USART_FLAG_TXE) == RESET);
				USART_SendData(USART_FOR_PRINTF_PTR, *ptr++);
			}
			return len;
			break;

		default:
			return 0;
			break;
	}
	return 0;
}

#ifdef USE_UART1
	#ifdef USE_UART1RXINTERRUPT
		bool_e UART1_data_ready()
		{
			return m_u1rx;
		}

		Uint8 UART1_get_next_msg()
		{
			static Uint32 next_to_read =0;
			if (m_u1rxnum > next_to_read)
			{
				NVIC_DisableIRQ(USART1_IRQn);
				if (m_u1rxnum - next_to_read == 1)
					m_u1rx = 0;
				NVIC_EnableIRQ(USART1_IRQn);
				return m_u1rxbuf[((next_to_read++) % UART_RX_BUF_SIZE)];
			}
			else
				return 0;
		}
	#endif /* def USE_UART1RXINTERRUPT */


	#ifdef USE_UART1TXINTERRUPT
		#ifndef BUFFER_U1TX_SIZE
			#warning "Vous devez définir la taille du buffer U1TX."
		#endif
		volatile Uint8 b1tx[BUFFER_U1TX_SIZE];
		volatile buffer_t buffer1tx = {b1tx,BUFFER_U1TX_SIZE,0,0,0};

		//Permet de savoir, venant de l'extérieur, si des données sont en cours d'envoi.
		bool_e IsNotEmpty_buffer_u1tx(void)
		{
			return IsNotEmpty_buffer(&buffer1tx);
		}

		//Permet de savoir, venant de l'extérieur, si le buffer est plein
		bool_e IsFull_buffer_u1tx(void)
		{
			return IsFull_buffer(&buffer1tx);
		}



		void UART1_putc(Uint8 c)
		{
			static bool_e reentrance_detection = FALSE;

			if(reentrance_detection)
				return;					//Si printf en IT pendant un printf, on abandonne le caractère du printf en IT..

			reentrance_detection = TRUE;
			if(USART_GetITStatus(USART1, USART_IT_TXE))
				USART_SendData(USART1, c);
			else
			{
				//mise en buffer + activation IT U1TX.

				assert(buffer1tx.nb_datas < buffer1tx.size + 1);
				//Critical section (Interrupt inibition)

				while(buffer1tx.nb_datas >= buffer1tx.size);	//ON BLOQUE ICI*
				//Si vous êtes bloqués ici....... vérifiez qu'aucun printf n'est fait en IT...

				NVIC_DisableIRQ(USART1_IRQn);	//On interdit la préemption ici.. pour éviter les Read pendant les Write.

				if(buffer1tx.nb_datas < buffer1tx.size)
				{
					buffer1tx.datas[buffer1tx.index_write] = c;
					buffer1tx.index_write = (buffer1tx.index_write>=buffer1tx.size-1)?0:(buffer1tx.index_write + 1);
					buffer1tx.nb_datas++;
				}

				NVIC_EnableIRQ(USART1_IRQn);	//On active l'IT sur TX... lors du premier caractère à envoyer...
				USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
			}
			reentrance_detection = FALSE;
		}
	#else	/* def USE_UART1TXINTERRUPT */

		//Fonction blocante
		void UART1_putc(Uint8 mes)
		{
			while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
			USART_SendData(USART1, mes);
		}
	#endif /* def USE_UART1TXINTERRUPT */


	void _ISR USART1_IRQHandler(void){
		#ifdef USE_UART1RXINTERRUPT
			if(USART_GetITStatus(USART1, USART_IT_RXNE)) {
				Uint8 * receiveddata = &(m_u1rxbuf[(m_u1rxnum%UART_RX_BUF_SIZE)]);

				while(USART_GetFlagStatus(USART1, USART_FLAG_RXNE)){
					#ifdef LED_UART
						toggle_led(LED_UART);
					#endif
					#ifdef MODE_SIMULATION
					static Uint8 we_are_receiving_can_msg = FALSE;
					Uint8 c;
					c = USART_ReceiveData(USART1);
					if(we_are_receiving_can_msg == 0)
					{
						if(c==0x01)
							we_are_receiving_can_msg = 1;
					}
					else
						we_are_receiving_can_msg++;

					if(we_are_receiving_can_msg)
					{
						*(receiveddata++) = c;
						m_u1rxnum++;
						m_u1rx =1;
						/* pour eviter les comportements indésirables */
						if (receiveddata - m_u1rxbuf >= UART_RX_BUF_SIZE)
							receiveddata = m_u1rxbuf;
					}
					if(we_are_receiving_can_msg == 13)	//Dernier octet du message can (0x04...)
						we_are_receiving_can_msg = 0;
					#else
						*(receiveddata++) = USART_ReceiveData(USART1);;
						m_u1rxnum++;
						m_u1rx =1;
						/* pour eviter les comportements indésirables */
						if (receiveddata - m_u1rxbuf >= UART_RX_BUF_SIZE)
							receiveddata = m_u1rxbuf;
					#endif
				}
				USART_ClearITPendingBit(USART1, USART_IT_RXNE);
			}
		#endif
		#ifdef USE_UART1TXINTERRUPT
			if(USART_GetITStatus(USART1, USART_IT_TXE)) {
				Uint8 c;

				//debufferiser.
				if(IsNotEmpty_buffer(&buffer1tx))
				{
					assert(buffer1tx.index_read < buffer1tx.size);
					//Critical section
					if(buffer1tx.nb_datas > (Uint8)0)
					{
						c = buffer1tx.datas[buffer1tx.index_read];
						buffer1tx.index_read = (buffer1tx.index_read>=buffer1tx.size-1)?0:(buffer1tx.index_read + 1);
						buffer1tx.nb_datas--;
						USART_SendData(USART1, c);
					}
					//Critical section

