samuelpoiraud/robot/STM32/QS/QS_uart.c
				}
				else if(!IsNotEmpty_buffer(&buffer3tx))
					USART_ITConfig(USART3, USART_IT_TXE, DISABLE);	//Si buffer vide -> Plus rien à envoyer -> désactiver IT TX.
			}
		#endif
	}

	#ifdef USE_UART3RXINTERRUPT
		bool_e UART3_data_ready()
		{
			return m_u3rx;
		}

		Uint8 UART3_get_next_msg()
		{
			static Uint32 next_to_read =0;
			if (m_u3rxnum > next_to_read)
			{
				NVIC_DisableIRQ(USART3_IRQn);
				if (m_u3rxnum - next_to_read == 1)
					m_u3rx = 0;
				NVIC_EnableIRQ(USART3_IRQn);
				return m_u3rxbuf[((next_to_read++) % UART_RX_BUF_SIZE)];
			}
			else
				return 0;
		}
	#endif /* def USE_UART3RXINTERRUPT */
#endif /* def USE_UART3 */


#ifdef USE_UART4
	#ifdef USE_UART4TXINTERRUPT
		#ifndef BUFFER_U4TX_SIZE
			#warning "Vous devez définir la taille du buffer U4TX."
		#endif
		volatile Uint8 b4tx[BUFFER_U4TX_SIZE];
		volatile buffer_t buffer4tx = {b4tx,BUFFER_U4TX_SIZE,0,0,0};

		//Permet de savoir, venant de l'extérieur, si des données sont en cours d'envoi.
		bool_e IsNotEmpty_buffer_u4tx(void)
		{
			return IsNotEmpty_buffer(&buffer4tx);
		}

		//Permet de savoir, venant de l'extérieur, si le buffer est plein
		bool_e IsFull_buffer_u4tx(void)
		{
			return IsFull_buffer(&buffer4tx);
		}


		void UART4_putc(Uint8 c)
		{
			if(USART_GetFlagStatus(UART4, USART_FLAG_TXE))
				USART_SendData(UART4, c);
			else
			{
				//mise en buffer + activation IT U4TX.

				assert(buffer4tx.nb_datas < buffer4tx.size + 1);
				//Critical section (Interrupt inibition)

				while(buffer4tx.nb_datas >= buffer4tx.size);	//ON BLOQUE ICI

				NVIC_DisableIRQ(UART4_IRQn);	//On interdit la préemption ici.. pour éviter les Read pendant les Write.

				if(buffer4tx.nb_datas < buffer4tx.size)
				{
					buffer4tx.datas[buffer4tx.index_write] = c;
					buffer4tx.index_write = (buffer4tx.index_write>=buffer4tx.size-1)?0:(buffer4tx.index_write + 1);
					buffer4tx.nb_datas++;
				}

				NVIC_EnableIRQ(UART4_IRQn);	//On active l'IT sur TX... lors du premier caractère à envoyer...
				USART_ITConfig(UART4, USART_IT_TXE, ENABLE);
			}
		}
	#else	/* def USE_UART4TXINTERRUPT */
		void UART4_putc(Uint8 mes)
		{
			while(USART_GetFlagStatus(UART4, USART_FLAG_TXE) == RESET);
			USART_SendData(UART4, mes);
		}
	#endif
	void _ISR UART4_IRQHandler(void)
	{
		#ifdef USE_UART4RXINTERRUPT
			if(USART_GetITStatus(UART4, USART_IT_RXNE)) {
				Uint8 * receiveddata = &(m_u4rxbuf[(m_u4rxnum%UART_RX_BUF_SIZE)]);

				while(USART_GetFlagStatus(UART4, USART_FLAG_RXNE))
				{
					#ifdef LED_UART
						toggle_led(LED_UART);
					#endif
					*(receiveddata++) = USART_ReceiveData(UART4);
					m_u4rxnum++;
					m_u4rx = 1;
					/* pour eviter les comportements indésirables */
					if (receiveddata - m_u4rxbuf >= UART_RX_BUF_SIZE)
						receiveddata = m_u4rxbuf;
				}
				USART_ClearITPendingBit(UART4, USART_IT_RXNE);
				NVIC_ClearPendingIRQ(UART4_IRQn);
			}
		#endif	//def USE_UART4RXINTERRUPT
		#ifdef USE_UART4TXINTERRUPT
			if(USART_GetITStatus(UART4, USART_IT_TXE)) {
				Uint8 c;

				//debufferiser.
				if(IsNotEmpty_buffer(&buffer4tx))
				{
					assert(buffer4tx.index_read < buffer4tx.size);
					//Critical section
					if(buffer4tx.nb_datas > (Uint8)0)
					{
						c = buffer4tx.datas[buffer4tx.index_read];
						buffer4tx.index_read = (buffer4tx.index_read>=buffer4tx.size-1)?0:(buffer4tx.index_read + 1);
						buffer4tx.nb_datas--;
						USART_SendData(UART4, c);
					}
					//Critical section

				}
				else if(!IsNotEmpty_buffer(&buffer4tx))
					USART_ITConfig(UART4, USART_IT_TXE, DISABLE);	//Si buffer vide -> Plus rien à envoyer -> désactiver IT TX.
			}
		#endif
	}

	#ifdef USE_UART4RXINTERRUPT
		bool_e UART4_data_ready()
		{
			return m_u4rx;
		}

		Uint8 UART4_get_next_msg()
		{
			static Uint32 next_to_read =0;
			if (m_u4rxnum > next_to_read)
			{
				NVIC_DisableIRQ(UART4_IRQn);
				if (m_u4rxnum - next_to_read == 1)
					m_u4rx = 0;
				NVIC_EnableIRQ(UART4_IRQn);
				return m_u4rxbuf[((next_to_read++) % UART_RX_BUF_SIZE)];
			}
			else
				return 0;
		}
	#endif /* def USE_UART4RXINTERRUPT */
#endif /* def USE_UART4 */

#ifdef USE_UART5
	#ifdef USE_UART5TXINTERRUPT
		#ifndef BUFFER_U5TX_SIZE
			#warning "Vous devez définir la taille du buffer U5TX."
		#endif
		volatile Uint8 b5tx[BUFFER_U5TX_SIZE];
		volatile buffer_t buffer5tx = {b5tx,BUFFER_U5TX_SIZE,0,0,0};

		//Permet de savoir, venant de l'extérieur, si des données sont en cours d'envoi.
		bool_e IsNotEmpty_buffer_u5tx(void)
		{
			return IsNotEmpty_buffer(&buffer5tx);
		}

		//Permet de savoir, venant de l'extérieur, si le buffer est plein
		bool_e IsFull_buffer_u5tx(void)
		{
			return IsFull_buffer(&buffer5tx);
		}


		void UART5_putc(Uint8 c)
		{
			if(USART_GetFlagStatus(USART5, USART_FLAG_TXE))
				USART_SendData(USART5, c);
			else
			{
				//mise en buffer + activation IT U5TX.

				assert(buffer5tx.nb_datas < buffer5tx.size + 1);
				//Critical section (Interrupt inibition)

				while(buffer5tx.nb_datas >= buffer5tx.size);	//ON BLOQUE ICI

				NVIC_DisableIRQ(USART5_IRQn);	//On interdit la préemption ici.. pour éviter les Read pendant les Write.

				if(buffer5tx.nb_datas < buffer5tx.size)
				{
					buffer5tx.datas[buffer5tx.index_write] = c;
					buffer5tx.index_write = (buffer5tx.index_write>=buffer5tx.size-1)?0:(buffer5tx.index_write + 1);
					buffer5tx.nb_datas++;
				}

				NVIC_EnableIRQ(USART5_IRQn);	//On active l'IT sur TX... lors du premier caractère à envoyer...
				USART_ITConfig(USART5, USART_IT_TXE, ENABLE);
			}
		}
	#else	/* def USE_UART5TXINTERRUPT */
		void UART5_putc(Uint8 mes)
		{
			while(USART_GetFlagStatus(UART5, USART_FLAG_TXE) == RESET);
			USART_SendData(UART5, mes);
		}
	#endif
	void _ISR UART5_IRQHandler(void)
	{
		#ifdef USE_UART5RXINTERRUPT
			if(USART_GetITStatus(UART5, USART_IT_RXNE)) {
				Uint8 * receiveddata = &(m_u5rxbuf[(m_u5rxnum%UART_RX_BUF_SIZE)]);

				while(USART_GetFlagStatus(UART5, USART_FLAG_RXNE))
				{
					#ifdef LED_UART
						toggle_led(LED_UART);
					#endif
					*(receiveddata++) = USART_ReceiveData(UART5);
					m_u5rxnum++;
					m_u5rx = 1;
					/* pour eviter les comportements indésirables */
					if (receiveddata - m_u5rxbuf >= UART_RX_BUF_SIZE)
						receiveddata = m_u5rxbuf;
				}
				USART_ClearITPendingBit(UART5, USART_IT_RXNE);
				NVIC_ClearPendingIRQ(UART5_IRQn);
			}
		#endif	//def USE_UART5RXINTERRUPT
		#ifdef USE_UART5TXINTERRUPT
			if(USART_GetITStatus(UART5, USART_IT_TXE)) {
				Uint8 c;

				//debufferiser.
				if(IsNotEmpty_buffer(&buffer5tx))
				{
					assert(buffer5tx.index_read < buffer5tx.size);
					//Critical section
					if(buffer5tx.nb_datas > (Uint8)0)
					{
						c = buffer5tx.datas[buffer5tx.index_read];
						buffer5tx.index_read = (buffer5tx.index_read>=buffer5tx.size-1)?0:(buffer5tx.index_read + 1);
						buffer5tx.nb_datas--;
						USART_SendData(UART5, c);
					}
					//Critical section

