samuelpoiraud/robot/STM32/QS/QS_uart.c
				}
				else if(!IsNotEmpty_buffer(&buffer5tx))
					USART_ITConfig(UART5, USART_IT_TXE, DISABLE);	//Si buffer vide -> Plus rien à envoyer -> désactiver IT TX.
			}
		#endif
	}

	#ifdef USE_UART5RXINTERRUPT
		bool_e UART5_data_ready()
		{
			return m_u5rx;
		}

		Uint8 UART5_get_next_msg()
		{
			static Uint32 next_to_read =0;
			if (m_u5rxnum > next_to_read)
			{
				NVIC_DisableIRQ(UART5_IRQn);
				if (m_u5rxnum - next_to_read == 1)
					m_u5rx = 0;
				NVIC_EnableIRQ(UART5_IRQn);
				return m_u5rxbuf[((next_to_read++) % UART_RX_BUF_SIZE)];
			}
			else
				return 0;
		}
	#endif /* def USE_UART5RXINTERRUPT */
#endif /* def USE_UART5 */

#ifdef USE_UART6
	#ifdef USE_UART6TXINTERRUPT
		#ifndef BUFFER_U6TX_SIZE
			#warning "Vous devez définir la taille du buffer U6TX."
		#endif
		volatile Uint8 b6tx[BUFFER_U6TX_SIZE];
		volatile buffer_t buffer6tx = {b6tx,BUFFER_U6TX_SIZE,0,0,0};

		//Permet de savoir, venant de l'extérieur, si des données sont en cours d'envoi.
		bool_e IsNotEmpty_buffer_u6tx(void)
		{
			return IsNotEmpty_buffer(&buffer6tx);
		}

		//Permet de savoir, venant de l'extérieur, si le buffer est plein
		bool_e IsFull_buffer_u6tx(void)
		{
			return IsFull_buffer(&buffer6tx);
		}


		void UART6_putc(Uint8 c)
		{
			if(USART_GetFlagStatus(USART6, USART_FLAG_TXE))
				USART_SendData(USART6, c);
			else
			{
				//mise en buffer + activation IT U6TX.

				assert(buffer6tx.nb_datas < buffer6tx.size + 1);
				//Critical section (Interrupt inibition)

				while(buffer6tx.nb_datas >= buffer6tx.size);	//ON BLOQUE ICI

				NVIC_DisableIRQ(USART6_IRQn);	//On interdit la préemption ici.. pour éviter les Read pendant les Write.

				if(buffer6tx.nb_datas < buffer6tx.size)
				{
					buffer6tx.datas[buffer6tx.index_write] = c;
					buffer6tx.index_write = (buffer6tx.index_write>=buffer6tx.size-1)?0:(buffer6tx.index_write + 1);
					buffer6tx.nb_datas++;
				}

				NVIC_EnableIRQ(USART6_IRQn);	//On active l'IT sur TX... lors du premier caractère à envoyer...
				USART_ITConfig(USART6, USART_IT_TXE, ENABLE);
			}
		}
	#else	/* def USE_UART6TXINTERRUPT */
		void UART6_putc(Uint8 mes)
		{
			while(USART_GetFlagStatus(USART6, USART_FLAG_TXE) == RESET);
			USART_SendData(USART6, mes);
		}
	#endif
	void _ISR USART6_IRQHandler(void)
	{
		#ifdef USE_UART6RXINTERRUPT
			if(USART_GetITStatus(USART6, USART_IT_RXNE)) {
				Uint8 * receiveddata = &(m_u6rxbuf[(m_u6rxnum%UART_RX_BUF_SIZE)]);

				while(USART_GetFlagStatus(USART6, USART_FLAG_RXNE))
				{
					#ifdef LED_UART
						toggle_led(LED_UART);
					#endif
					*(receiveddata++) = USART_ReceiveData(USART6);
					m_u6rxnum++;
					m_u6rx = 1;
					/* pour eviter les comportements indésirables */
					if (receiveddata - m_u6rxbuf >= UART_RX_BUF_SIZE)
						receiveddata = m_u6rxbuf;
				}
				USART_ClearITPendingBit(USART6, USART_IT_RXNE);
				NVIC_ClearPendingIRQ(USART6_IRQn);
			}
		#endif	//def USE_UART6RXINTERRUPT
		#ifdef USE_UART6TXINTERRUPT
			if(USART_GetITStatus(USART6, USART_IT_TXE)) {
				Uint8 c;

				//debufferiser.
				if(IsNotEmpty_buffer(&buffer6tx))
				{
					assert(buffer6tx.index_read < buffer6tx.size);
					//Critical section
					if(buffer6tx.nb_datas > (Uint8)0)
					{
						c = buffer6tx.datas[buffer6tx.index_read];
						buffer6tx.index_read = (buffer6tx.index_read>=buffer6tx.size-1)?0:(buffer6tx.index_read + 1);
						buffer6tx.nb_datas--;
						USART_SendData(USART6, c);
					}
					//Critical section

				}
				else if(!IsNotEmpty_buffer(&buffer6tx))
					USART_ITConfig(USART6, USART_IT_TXE, DISABLE);	//Si buffer vide -> Plus rien à envoyer -> désactiver IT TX.
			}
		#endif
	}

	#ifdef USE_UART6RXINTERRUPT
		bool_e UART6_data_ready()
		{
			return m_u6rx;
		}

		Uint8 UART6_get_next_msg()
		{
			static Uint32 next_to_read =0;
			if (m_u6rxnum > next_to_read)
			{
				NVIC_DisableIRQ(USART6_IRQn);
				if (m_u6rxnum - next_to_read == 1)
					m_u6rx = 0;
				NVIC_EnableIRQ(USART6_IRQn);
				return m_u6rxbuf[((next_to_read++) % UART_RX_BUF_SIZE)];
			}
			else
				return 0;
		}
	#endif /* def USE_UART6RXINTERRUPT */
#endif /* def USE_UART6 */
